/*
 */
package com.pb.poliscuk.hw5;

public class Library {

   static Book[] bookLib = new Book[5];
   static Reader[] userLib = new Reader[11];

    public static void main(String[] args) {
        // заполним библиотеку книгами
        for (int i=0; i<bookLib.length; i++) bookLib[i] = new Book();
          bookLib[0].setBook("Java для чайников", "Чак Сфер", 2006);
          bookLib[1].setBook("Книга Чистий код. Створення і рефакторинг за допомогою Agile", "Роберт Сесил Мартин", 2019);
          bookLib[2].setBook("Основы Java", "Николай Прохоренок", 2019);
          bookLib[3].setBook("Як пасти котів", "Дж. Ханк Рейнвотер", 2020);
          bookLib[4].setBook("Стів Джобс", "Уолтер Айзексон", 2011);
         
        // пользователи библиотеки
        for (int i=0; i<userLib.length; i++) userLib[i] = new Reader();
          userLib[0].setReader("Пупкин Д.В.", "АК-0047", "Факультет радіоелектроніки, комп'ютерних систем та інфокомунікацій", 1980, "+370632598745");
          userLib[1].setReader("Жогов Д.В.", "АК-0041", "Факультет радіоелектроніки, комп'ютерних систем та інфокомунікацій", 1980, "+370632598745");
          userLib[2].setReader("Котов Д.В.", "АК-0042", "Факультет літакобудування", 1980, "+370632598745");
          userLib[3].setReader("Наумов А.Г.", "АК-0056", "Факультет авіаційних двигунів", 1980, "+370632598745");
          userLib[4].setReader("Осипова У.В.", "АК-0057", "Факультет авіаційних двигунів", 1980, "+370632598745");
          userLib[5].setReader("Сергеева В.Г.", "АК-0050", "Факультет літакобудування", 1980, "+370632598745");
          userLib[6].setReader("Старчикова Д.В.", "АК-0051", "Факультет авіаційних двигунів", 1980, "+370632598745");
          userLib[7].setReader("Тамаровский С.В.", "АК-0048", "Факультет літакобудування", 1980, "+370632598745");
          userLib[8].setReader("Терехова Д.А.", "АК-0040", "Факультет радіоелектроніки, комп'ютерних систем та інфокомунікацій", 1980, "+370632598745");
          userLib[9].setReader("Чеченков О.К.", "АК-0039", "Факультет радіоелектроніки, комп'ютерних систем та інфокомунікацій", 1980, "+370632598745");
          userLib[10].setReader("Пяточкин К.В.", "АК-0061", "Факультет літакобудування", 1980, "+370632598745");
          
          // выводим список всех книг в библиотеке  
          System.out.println("---------  Имеющиеся в библиотеке книги ---------");
          for (int i=0; i<bookLib.length; i++) bookLib[i].getBook();
          
          //выводим списк всех пользователей библиотеки
          System.out.println("---------- Пользователи библиотеки --------------");
          for (int i=0; i<userLib.length; i++) userLib[i].getReader();
    }
}
